CREATE TABLE IF NOT EXISTS deanats (
    id SERIAL PRIMARY KEY,
    name VARCHAR(255) NOT NULL,
    address VARCHAR(255),
    phone VARCHAR(50)
    );

INSERT INTO deanats (name, address, phone)
VALUES ('Деканат матфак', 'ул. Университетская, 1', '+7-999-000-11-22'),
       ('Деканат физфак', 'пр. Науки, 5', '+7-999-000-22-33'),
       ('Деканат исторического', 'ул. Историческая, 12', '+7-999-000-33-44'),
       ('Деканат филологов', 'ул. Литейная, 7', '+7-999-000-44-55'),
       ('Деканат ИТ', 'ул. Программная, 21', '+7-999-000-55-66');
